7_28/cronograma.org
#+TITLE:	Exercício 7.28 (Tardos)
#+AUTHOR:	Alice Duarte Scarpa, Bruno Lucian Costa
#+EMAIL:	alicescarpa@gmail.com, bruno.lucian.costa@gmail.com
#+DATE:		2015-06-23
#+OPTIONS: tex:t
#+OPTIONS: toc:nil
#+STARTUP: showall
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LaTeX_HEADER: \usemintedstyle{perldoc}
#+LaTeX_HEADER: \usepackage{tikz}
#+LaTeX_HEADER: \usetikzlibrary{decorations.markings}
#+LaTeX_HEADER: \tikzstyle{vertex}=[circle, draw, inner sep=0pt, minimum size=7pt]
#+LaTeX_HEADER: \providecommand{\vertex}{\node[vertex]}

* Enunciado

Um grupo de estudantes está escrevendo um módulo para preparar
cronogramas de monitoria. O protótipo inicial deles funciona do
seguinte modo: O cronograma é semanal, de modo que podemos nos focar
em uma única semana.

    * O administrador do curso escolhe um conjunto de $k$
      intervalos disjuntos de uma hora de duração $I_1, I_2, \ldots,
      I_k$, nos quais seria possível que monitores dessem suas
      monitorias; o cronograma final consistirá de um subconjunto de
      alguns (mas geralmente não todos) esses intervalos.
   *  Cada monitor então entra com seu horário semanal, informando
      as horas em que ele está disponível para monitorias.
   *  O administrador então especifica, para parâmetros $a$, $b$ e
      $c$, que cada monitor deve dar entre $a$ e $b$ horas de
      monitoria por semana, e que um total de $c$ horas de monitoria
      deve ser dado semanalmente.

O problema é escolher um subconjunto dos horários (intervalos) e
atribuir um monitor a cada um desses horários, respeitando a
disponibilidade dos monitores e as restrições impostas pelo
administrador.


   a) Dê um algoritmo polinomial que ou constrói um cronograma
      válido de horas de monitoria (especificando que monitor cobre
      quais horários) ou informa que não há cronograma válido.


   b) O algoritmo acima tornou-se popular, e surgiu a vontade de
      controlar também a densidade das monitorias: dado números $d_i$,
      com $i$ entre $1$ e $5$, queremos um cronograma com pelo menos
      $d_i$ horários de monitoria no dia da semana $i$. Dê um
      algoritmo polinomial para resolver o problema com essa restrição
      adicional.


* Introdução

Queremos modelar esse problema como um problema de fluxo. Para isso
vamos começar com algumas definições de fluxo.

** Definições

Uma rede de fluxo é um grafo direcionado $G =
(V, E)$ com as seguintes propriedades:
    * Existe um único vértice \textit{fonte} $s \in V$. Nenhuma aresta entra em $s$.
    * A cada aresta $e$ está associada uma capacidade inteira $c_e$ e
      uma demanda $d_e$ tal que $c_e \geq d_e \geq 0$.
    * Existe um único vértice \textit{dreno} $t \in V$. Nenhuma aresta sai de $t$.

Um fluxo $f$ de $s$ a $t$ é uma função $f \colon E \to R^+$ que associa a cada
aresta $e$ um valor real não-negativo $f(e)$ tal que:

  1. $\forall e \in E, d_e \leq f(e) \leq c_e$
  2. Para todo nó $v \not\in \{s,t\}$:
     \[ \sum_{e \text{ chegando em } v} f(e) = \sum_{e \text{ saindo de } v} f(e) \]

$f(e)$ representa o fluxo que vai passar pela aresta $e$. O valor de
um fluxo é o total que parte da fonte $s$, isso é:

\begin{equation}
\label{valor_fluxo} \mathrm{Valor}(f) = \sum_{e \text{ saindo de } s} f(e)
\end{equation}

** Representação

Vamos usar uma classe para representar arestas. Uma aresta é
inicializada com as propriedades: vértice de origem, vértice de
destino, capacidade e demanda.

Para facilitar o processamento futuro, vamos adicionar também as
propriedades reversa e original. Reversa aponta para uma outra aresta
reversa à atual, a propriedade original é uma flag indicando se a
aresta pertence à rede original ou não.
#+NAME: definindo_classe_aresta
#+BEGIN_SRC python
class Aresta():
    def __init__(self, origem, destino, capacidade, demanda):
        self.origem = origem
        self.destino = destino
        self.capacidade = capacidade
        self.demanda = demanda
        self.reversa = None
        self.original = True
#+END_SRC

Agora que temos a classe Aresta, vamos usá-la para auxiliar na
representação de uma rede de fluxo também como objeto.

Uma rede de fluxo tem duas propriedades: adjacências, um dicionário
que mapeia cada vértice às arestas que saem dele e fluxo.

O construtor da classe inicializa as duas propriedades como dicionários vazios.

Vamos precisar dos seguintes métodos na nossa classe RedeDeFluxo:

- ~novo_vertice(v)~: Adiciona o vértice v à rede
- ~nova_aresta(origem, destino, capacidade)~: Adiciona uma nova aresta a
   rede. Também cria a aresta reversa.
- ~novo_fluxo(f, e)~: Adiciona um fluxo $f$ à aresta $e$
- ~encontra_arestas(v)~: Retorna as arestas que partem do vértice $v$
- ~valor_do_fluxo(fonte)~: Encontra o valor do fluxo, como definido em \eqref{valor_fluxo}.

#+NAME: definindo_classe_rede
#+BEGIN_SRC python
class RedeDeFluxo():
    def __init__(self):
        self.adj = collections.OrderedDict()
        self.fluxo = {}

    def novo_vertice(self, v):
        self.adj[v] = []

    def nova_aresta(self, origem, destino, capacidade, demanda):
        aresta = Aresta(origem, destino, capacidade, demanda)
        self.adj[origem].append(aresta)

        # Criando a aresta reversa
        aresta_reversa = Aresta(destino, origem, 0, -demanda)
        self.adj[destino].append(aresta_reversa)
        aresta_reversa.original = False

        # Marcando aresta e aresta_reversa como reversas uma da outra
        aresta.reversa = aresta_reversa
        aresta_reversa.reversa = aresta

    def novo_fluxo(self, e, f):
        self.fluxo[e] = f

    def encontra_arestas(self, v):
        return self.adj[v]

    def valor_do_fluxo(self, fonte):
        valor = 0
        for aresta in self.encontra_arestas(fonte):
            valor += self.fluxo[aresta]
        return valor

#+END_SRC

