7_28/cronograma.org
** Fluxo máximo

Vamos começar estudando o problema de encontrar o fluxo máximo de uma
rede $G$ em que $d_e = 0 \; \forall e \in E$ $f$. Vamos implementar aqui o
algoritmo de Ford-Fulkerson para resolver esse problema.

O algoritmo tem 2 partes:

  1. Dado um caminho $P$ e partindo de um fluxo inicial $f$, obter um
     novo fluxo $f'$ expandindo $f$ em $P$
  2. Partindo do fluxo $f(e)$ = 0, expandir o fluxo enquanto for possível


- Primeira parte:

Queremos expandir o fluxo $f$ em $P$. Mais precisamente, queremos
mudar o valor do fluxo somando $x$ ao valor de $f(e)$ para toda aresta
$e$ que está no caminho $P$.

O gargalo de um caminho $P$ (com relação a um fluxo $f$) é o maior
valor de $x$ tal que $f(e) + x \leq c_e$ para toda aresta $e \in
P$. Essa última condição significa que o fluxo

\[ f'(e) = \begin{cases}f(e)&\text{ se } e \not\in P \\
                        f(e) + x&\text{ se } e \in P\end{cases} \]

ainda satisfaz as restrições de capacidade. O código abaixo computa
tal valor de $x$.
#+Name: gargalo
#+BEGIN_SRC python
def encontra_gargalo(self, caminho):
    residuos = []
    for aresta in caminho:
        residuos.append(aresta.capacidade - self.fluxo[aresta])
    return min(residuos)
#+END_SRC

#+RESULTS:

Como descrito acima, expandir o caminho é somar $x$ ao valor de $f(e)$
para cada aresta do caminho. Precisamos atualizar também as arestas
reversas, pois elas precisam satisfazer a propriedade $f(e) =
-f(e.reversa)$.
#+NAME: expande
#+BEGIN_SRC python
def expande_caminho(self, caminho):
    gargalo = self.encontra_gargalo(caminho)
    for aresta in caminho:
        self.fluxo[aresta] += gargalo
        self.fluxo[aresta.reversa] -= gargalo
#+END_SRC

Pela definição de gargalo, a operação de expandir $P$ gera um fluxo
válido. Se garantirmos que $c_e - f(e)$ é positivo para toda $e \in
P$, então o gargalo também será positivo, de modo que o fluxo $f'$
obtido terá valor maior que o anterior.

Tendo a restrição acima em mente, iremos fazer uma DFS no grafo,
usando apenas as arestas que possuem $c_e - f(e)$ (chamaremos esse
valor de ~residuo~) positivo.

Mais precisamente, a função abaixo recebe um caminho parcialmente
construído da fonte até ~v~ na variável ~caminho~ e recursivamente
encontra uma maneira de chegar em dreno a partir de ~v~ usando apenas
vértices não explorados. Se um caminho de ~v~ a dreno não existir, a
função não retorna um valor (isto é, retorna ~None~).

#+NAME: encontra_caminho
#+BEGIN_SRC python
def encontra_caminho(self, v, dreno, caminho, visitados):
    if v == dreno:
        return caminho

    visitados.add(v)

    for aresta in self.encontra_arestas(v):
        residuo = aresta.capacidade - self.fluxo[aresta]
        if residuo > 0 and aresta.destino not in visitados:
            resp = self.encontra_caminho(aresta.destino,
                                         dreno,
                                         caminho + [aresta],
                                         visitados)
            if resp != None:
                return resp
#+END_SRC

Como só chamamos a função com primeiro parâmetro igual a ~w~ quando
~w~ não está no conjunto de vértices visitados e ~w~ é imediatamente
colocado em tal conjunto depois da chamada, chamamos a função uma
única vez por vértice. Como a função demora tempo proporcional ao
número de arestas que saem do vértice em questão, o tempo total gasto
em todas as chamadas da função é $O(|V| + |E|)$.

Para as outras funções, note que um caminho tem no máximo $|V|$
vértices, e portanto as funções ~encontra_gargalo~ e ~expande_caminho~
têm complexidade $O(|V|)$.

#+RESULTS:

Para a parte 2, vamos precisar criar um fluxo $f$ com $f(e) = 0$ para
toda aresta $e$. Podemos fazer isso utilizando o seguinte método na
classe RedeDeFluxo():
#+NAME: fluxo_inicial
#+BEGIN_SRC python
def cria_fluxo_inicial(self):
    for vertice, arestas in self.adj.iteritems():
        for aresta in arestas:
            self.fluxo[aresta] = 0
#+END_SRC

Com todas as funções auxiliares prontas, podemos finalmente definir a
função que encontra o fluxo máximo, repetidamente aumentando o fluxo
como descrito na parte 1:
#+NAME: fluxo_maximo
#+BEGIN_SRC python
def fluxo_maximo(self, fonte, dreno):
    self.cria_fluxo_inicial()

    caminho = self.encontra_caminho(fonte, dreno, [], set())
    while caminho is not None:
        self.expande_caminho(caminho)
        caminho = self.encontra_caminho(fonte, dreno, [], set())
    return self.valor_do_fluxo(fonte)
#+END_SRC

Como o fluxo aumenta em pelo menos uma unidade por iteração e o custo
de uma iteração é $O(|V| + |E|)$, a complexidade total do algoritmo é
$O((|V|+|E|)F)$, onde $F$ é o fluxo máximo possível na rede. No caso
do exercício, $F$ é no máximo o número de intervalos e portanto
polinomial no tamanho da entrada.

** Fluxo válido com demandas não-nulas

O nosso objetivo é encontrar um fluxo válido $f$ para uma rede $G =
(V, E)$ no caso em que as demandas são positivas.

Vamos construir uma rede $G' = (V', E')$ com um valor associado $d$
tal que $d_e = 0 \; \forall e \in E'$ de tal forma que um fluxo válido
para $G$ existe se e somente se o valor do fluxo máximo em $G'$ é
$d$. Em caso afirmativo, podemos construir um fluxo válido $f$ para
$G$ rapidamente a partir de qualquer fluxo máximo $f'$ de $G'$.

Construimos $G'$ da seguinte forma:

- Criamos um vértice em $G'$ para cada vértice $G$
- Adicionamos uma fonte adicional $F$ e um dreno adicional $D$ a $G'$
- Definimos o saldo de cada vértice $v \in V$ como: \[
  \textrm{saldo}(v) = \sum_{e \text{ saindo de }v}d_e - \sum_{e \text{
  chegando em }v}d_e \]
- Se $\mathrm{saldo}(v) > 0$ adicionamos uma aresta $(v, D,
  \mathrm{saldo}(v), 0)$ a $G'$
- Se $\mathrm{saldo}(v) < 0$ adicionamos uma aresta $(F, v,
  -\mathrm{saldo}(v), 0)$ a $G'$
- Para cada aresta $e = (\mathrm{origem, destino, capacidade,
  demanda}) \in E$, crie uma aresta $e' = (\mathrm{origem, destino,
  capacidade - demanda, 0})$ em $G'$

Codificando a construção acima:
#+NAME: cria_rede_com_demandas_nulas
#+BEGIN_SRC python
def cria_rede_com_demandas_nulas(G):
    G_ = RedeDeFluxo()
    G_.novo_vertice('F')
    G_.novo_vertice('D')
    d = 0

    for vertice, arestas in G.adj.iteritems():
        G_.novo_vertice(vertice)
        saldo = sum(e.demanda for e in arestas)
        if saldo > 0:
            G_.nova_aresta(vertice, 'D', saldo, 0)
            d += saldo
        elif saldo < 0:
            G_.nova_aresta('F', vertice, -saldo, 0)

    for arestas in G.adj.values():
        for a in arestas:
             if a.original:
                 G_.nova_aresta(a.origem,
                                a.destino,
                                a.capacidade - a.demanda,
                                0)
    return G_, d
#+END_SRC

#+RESULTS:

* Rodando o algoritmo

