7_28/cronograma.org
** Item A
A seguinte tabela mostra a disponibilidade dos monitores nos horários
escolhidos pelo administrador:

#+ATTR_LATEX: :align lccccccccc
#+tblname: horarios
|         | Ana | Bia | Caio | Davi | Edu | Felipe | Gabi | Hugo | Isa |
| Seg 10h |     |     |      | x    |     |        |      |      |     |
| Seg 14h |     |     |      |      |     | x      | x    | x    | x   |
| Seg 21h | x   |     |      | x    |     |        |      |      |     |
| Ter 10h | x   | x   |      | x    |     |        |      |      |     |
| Ter 16h |     |     | x    |      |     |        |      |      |     |
| Ter 20h |     |     |      |      |     |        | x    |      | x   |
| Qua 9h  |     |     |      |      |     | x      |      |      |     |
| Qua 17h |     |     | x    |      |     |        |      |      |     |
| Qua 19h |     |     |      |      |     |        |      | x    |     |
| Qui 7h  |     | x   |      |      |     | x      |      |      |     |
| Qui 13h |     |     |      |      |     |        | x    |      |     |
| Qui 19h |     | x   |      |      | x   |        |      | x    |     |
| Sex 7h  |     |     | x    |      | x   |        |      |      |     |
| Sex 11h | x   |     |      |      | x   |        |      |      | x   |
| Sex 21h |     |     | x    |      |     | x      |      |      | x   |
As outras regras para monitoria estão na tabela abaixo:

#+tblname: regras
| Min de horas por monitor |  1 |
| Max de horas por monitor |  3 |
| Horas de monitoria       | 10 |

Podemos carregar as informações das tabelas para criar uma rede como
descrita no final da Seção \ref{modelagem_fluxo}.
#+NAME: processa_horarios
#+BEGIN_SRC python
# Lendo a tabela de disponibilidade
intervalos = collections.OrderedDict()
monitores = horarios[0][1:]

for disponibilidade in horarios[1:]:
    intervalos[disponibilidade[0]] = []
    for i, slot in enumerate(disponibilidade[1:]):
        if slot != '':
            intervalos[disponibilidade[0]].append(monitores[i])
#+END_SRC

#+RESULTS: tb_horarios

#+RESULTS:

Lendo a tabela de regras
#+NAME: processa_regras
#+BEGIN_SRC python
min_horas = regras[0][1]
max_horas = regras[1][1]
total_horas = regras[2][1]
#+END_SRC

#+RESULTS: tb_regras

#+RESULTS:

Criando uma rede para o problema com os dados fornecidos

#+NAME: cria_rede
#+BEGIN_SRC python
def cria_rede(intervalos, monitores, min_horas, max_horas, total_horas):
    G = RedeDeFluxo()
    G.novo_vertice('Fonte')
    G.novo_vertice('Dreno')
    G.nova_aresta('Dreno', 'Fonte', total_horas, total_horas)

    # Criando um vertice para cada monitor e ligando esse vertice
    # ao dreno
    for monitor in monitores:
        G.novo_vertice(monitor)
        G.nova_aresta(monitor, 'Dreno', max_horas, min_horas)

    for intervalo, monitores_disponiveis in intervalos.iteritems():
        # Criando um vertice para cada intervalo e conectando a
        # fonte a cada um dos intervalos
        G.novo_vertice(intervalo)
        G.nova_aresta('Fonte', intervalo, 1, 0)

        # Conectando o intervalo a cada monitor disponivel nele
        for monitor in monitores_disponiveis:
            G.nova_aresta(intervalo, monitor, 1, 0)

    return G
#+END_SRC

#+RESULTS:

Agora é só rodar o algoritmo com o grafo obtido:
#+NAME: rodando_cronograma
#+BEGIN_SRC python
G = cria_rede(intervalos, monitores, min_horas, max_horas, total_horas)
G_, d = cria_rede_com_demandas_nulas(G)
fluxo = G_.fluxo_maximo('F', 'D')
if fluxo == d:
    tabela_de_monitores = []
    for horario in intervalos:
        for w in G_.adj[horario]:
            if G_.fluxo[w] == 1:
                tabela_de_monitores.append([w.origem, w.destino])
    return tabela_de_monitores
else:
    return 'Impossivel'
#+END_SRC

No final, obtemos ou 'Impossível' se não existir um horário compatível
ou uma tabela com um horário que atende a todas as restrições.

Para a tabela acima:
#+BEGIN_SRC python :tangle solucao_a.py :noweb yes :exports results :var horarios=horarios regras=regras
# coding: utf-8
import collections

<<definindo_classe_aresta>>

<<definindo_classe_rede>>

    <<gargalo>>

    <<expande>>

    <<fluxo_inicial>>

    <<encontra_caminho>>

    <<fluxo_maximo>>

<<cria_rede_com_demandas_nulas>>

<<processa_horarios>>

<<processa_regras>>

<<cria_rede>>

<<rodando_cronograma>>
#+END_SRC

** Item B

No item b, além de todas as restrições do item a, há também a
restrição de mínimo de horas por dia da semana.

Vamos expressar a nova restrição com uma tabela:

#+tblname: min_por_dia
| Seg | 1 |
| Ter | 1 |
| Qua | 2 |
| Qui | 1 |
| Sex | 1 |

Parsear a nova tabela é simples:
#+Name: processa_por_dia
#+BEGIN_SRC python
minimo_por_dia = {}
for dia in min_por_dia:
    minimo_por_dia[dia[0]] = dia[1]
#+END_SRC

A única função que precisamos alterar do item a é a função
~cria_rede~, que agora tem que lidar com a construção mencionada na
Seção \ref{modelagem_fluxo}.

#+NAME: cria_rede_b
#+BEGIN_SRC python
def cria_rede(intervalos, monitores, min_horas,
              max_horas, total_horas, minimo_por_dia):
    G = RedeDeFluxo()
    G.novo_vertice('Fonte')
    G.novo_vertice('Dreno')
    G.nova_aresta('Dreno', 'Fonte', total_horas, total_horas)

    # Criando um vertice para cada monitor e ligando esse vertice
    # ao dreno
    for monitor in monitores:
        G.novo_vertice(monitor)
        G.nova_aresta(monitor, 'Dreno', max_horas, min_horas)

    # Criando um vertice para cada dia e uma aresta da Fonte
    # ao dia com demanda igual ao minimo de horas de monitoria
    # para aquele dia e capacidade suficientemente grande
    # (vamos usar o total de horas)
    dias = minimo_por_dia.keys()
    for dia in dias:
        G.novo_vertice(dia)
        G.nova_aresta('Fonte', dia, total_horas, minimo_por_dia[dia])

    for intervalo, monitores_disponiveis in intervalos.iteritems():
        # Encontrando o dia do intervalo
        for dia in dias:
            if intervalo.startswith(dia):
                dia_do_intervalo = dia

        # Criando um vertice para cada intervalo e conectando o
        # dia do intervalo a cada um dos intervalos
        G.novo_vertice(intervalo)
        G.nova_aresta(dia_do_intervalo, intervalo, 1, 0)

        # Conectando o intervalo a cada monitor disponivel nele
        for monitor in monitores_disponiveis:
            G.nova_aresta(intervalo, monitor, 1, 0)

    return G
#+END_SRC

#+NAME: rodando_cronograma_b
#+BEGIN_SRC python :exports none
G = cria_rede(intervalos, monitores, min_horas, max_horas, total_horas, minimo_por_dia)
G_, d = cria_rede_com_demandas_nulas(G)
fluxo = G_.fluxo_maximo('F', 'D')
if fluxo == d:
    tabela_de_monitores = []
    for horario in intervalos:
        for w in G_.adj[horario]:
            if G_.fluxo[w] == 1:
                tabela_de_monitores.append([w.origem, w.destino])
    return tabela_de_monitores
else:
    return 'Impossivel'
#+END_SRC


#+BEGIN_SRC python :tangle solucao_b.py :noweb yes :exports results :var horarios=horarios regras=regras min_por_dia=min_por_dia
# coding: utf-8
import collections

<<definindo_classe_aresta>>

<<definindo_classe_rede>>

    <<gargalo>>

    <<expande>>

    <<fluxo_inicial>>

    <<encontra_caminho>>

    <<fluxo_maximo>>

<<cria_rede_com_demandas_nulas>>

<<processa_horarios>>

<<processa_regras>>

<<processa_por_dia>>

<<cria_rede_b>>

<<rodando_cronograma_b>>
#+END_SRC

# Local Variables:
# coding: utf-8
# End:
