7_28/cronograma.tex

\subsection{Item A}
\label{sec-5-1}
A seguinte tabela mostra a disponibilidade dos monitores nos horários
escolhidos pelo administrador:

\begin{center}
\begin{tabular}{lccccccccc}
 & Ana & Bia & Caio & Davi & Edu & Felipe & Gabi & Hugo & Isa\\
Seg 10h &  &  &  & x &  &  &  &  & \\
Seg 14h &  &  &  &  &  & x & x & x & x\\
Seg 21h & x &  &  & x &  &  &  &  & \\
Ter 10h & x & x &  & x &  &  &  &  & \\
Ter 16h &  &  & x &  &  &  &  &  & \\
Ter 20h &  &  &  &  &  &  & x &  & x\\
Qua 9h &  &  &  &  &  & x &  &  & \\
Qua 17h &  &  & x &  &  &  &  &  & \\
Qua 19h &  &  &  &  &  &  &  & x & \\
Qui 7h &  & x &  &  &  & x &  &  & \\
Qui 13h &  &  &  &  &  &  & x &  & \\
Qui 19h &  & x &  &  & x &  &  & x & \\
Sex 7h &  &  & x &  & x &  &  &  & \\
Sex 11h & x &  &  &  & x &  &  &  & x\\
Sex 21h &  &  & x &  &  & x &  &  & x\\
\end{tabular}
\end{center}
As outras regras para monitoria estão na tabela abaixo:

\begin{center}
\begin{tabular}{lr}
Min de horas por monitor & 1\\
Max de horas por monitor & 3\\
Horas de monitoria & 10\\
\end{tabular}
\end{center}

Podemos carregar as informações das tabelas para criar uma rede como
descrita no final da Seção \ref{modelagem_fluxo}.
\begin{minted}[]{python}
# Lendo a tabela de disponibilidade
intervalos = collections.OrderedDict()
monitores = horarios[0][1:]

for disponibilidade in horarios[1:]:
    intervalos[disponibilidade[0]] = []
    for i, slot in enumerate(disponibilidade[1:]):
        if slot != '':
            intervalos[disponibilidade[0]].append(monitores[i])
\end{minted}

Lendo a tabela de regras
\begin{minted}[]{python}
min_horas = regras[0][1]
max_horas = regras[1][1]
total_horas = regras[2][1]
\end{minted}

Criando uma rede para o problema com os dados fornecidos

\begin{minted}[]{python}
def cria_rede(intervalos, monitores, min_horas, max_horas, total_horas):
    G = RedeDeFluxo()
    G.novo_vertice('Fonte')
    G.novo_vertice('Dreno')
    G.nova_aresta('Dreno', 'Fonte', total_horas, total_horas)

    # Criando um vertice para cada monitor e ligando esse vertice
    # ao dreno
    for monitor in monitores:
        G.novo_vertice(monitor)
        G.nova_aresta(monitor, 'Dreno', max_horas, min_horas)

    for intervalo, monitores_disponiveis in intervalos.iteritems():
        # Criando um vertice para cada intervalo e conectando a
        # fonte a cada um dos intervalos
        G.novo_vertice(intervalo)
        G.nova_aresta('Fonte', intervalo, 1, 0)

        # Conectando o intervalo a cada monitor disponivel nele
        for monitor in monitores_disponiveis:
            G.nova_aresta(intervalo, monitor, 1, 0)

    return G
\end{minted}

Agora é só rodar o algoritmo com o grafo obtido:
\begin{minted}[]{python}
G = cria_rede(intervalos, monitores, min_horas, max_horas, total_horas)
G_, d = cria_rede_com_demandas_nulas(G)
fluxo = G_.fluxo_maximo('F', 'D')
if fluxo == d:
    tabela_de_monitores = []
    for horario in intervalos:
        for w in G_.adj[horario]:
            if G_.fluxo[w] == 1:
                tabela_de_monitores.append([w.origem, w.destino])
    return tabela_de_monitores
else:
    return 'Impossivel'
\end{minted}

No final, obtemos ou 'Impossível' se não existir um horário compatível
ou uma tabela com um horário que atende a todas as restrições.

Para a tabela acima:
\begin{center}
\begin{tabular}{ll}
Seg 10h & Davi\\
Seg 14h & Gabi\\
Seg 21h & Ana\\
Ter 10h & Bia\\
Ter 16h & Caio\\
Ter 20h & Isa\\
Qua 9h & Felipe\\
Qua 17h & Caio\\
Qua 19h & Hugo\\
Qui 19h & Edu\\
\end{tabular}
\end{center}

\subsection{Item b}
\label{sec-5-2}

No item b, além de todas as restrições do item a, há também a
restrição de mínimo de horas por dia da semana.

Vamos expressar a nova restrição com uma tabela:

\begin{center}
\begin{tabular}{lr}
Seg & 1\\
Ter & 1\\
Qua & 2\\
Qui & 1\\
Sex & 1\\
\end{tabular}
\end{center}

Parsear a nova tabela é simples:
\begin{minted}[]{python}
minimo_por_dia = {}
for dia in min_por_dia:
    minimo_por_dia[dia[0]] = dia[1]
\end{minted}

A única função que precisamos alterar do item a é a função
\verb~cria_rede~, que agora tem que lidar com a construção mencionada em TODO.

\begin{minted}[]{python}
def cria_rede(intervalos, monitores, min_horas,
              max_horas, total_horas, minimo_por_dia):
    G = RedeDeFluxo()
    G.novo_vertice('Fonte')
    G.novo_vertice('Dreno')
    G.nova_aresta('Dreno', 'Fonte', total_horas, total_horas)

    # Criando um vertice para cada monitor e ligando esse vertice
    # ao dreno
    for monitor in monitores:
        G.novo_vertice(monitor)
        G.nova_aresta(monitor, 'Dreno', max_horas, min_horas)

    # Criando um vertice para cada dia e uma aresta da Fonte
    # ao dia com demanda igual ao minimo de horas de monitoria
    # para aquele dia e capacidade suficientemente grande
    # (vamos usar o total de horas)
    dias = minimo_por_dia.keys()
    for dia in dias:
        G.novo_vertice(dia)
        G.nova_aresta('Fonte', dia, total_horas, minimo_por_dia[dia])

    for intervalo, monitores_disponiveis in intervalos.iteritems():
        # Encontrando o dia do intervalo
        for dia in dias:
            if intervalo.startswith(dia):
                dia_do_intervalo = dia

        # Criando um vertice para cada intervalo e conectando o
        # dia do intervalo a cada um dos intervalos
        G.novo_vertice(intervalo)
        G.nova_aresta(dia_do_intervalo, intervalo, 1, 0)

        # Conectando o intervalo a cada monitor disponivel nele
        for monitor in monitores_disponiveis:
            G.nova_aresta(intervalo, monitor, 1, 0)

    return G
\end{minted}

\begin{center}
\begin{tabular}{ll}
Seg 10h & Davi\\
Seg 14h & Isa\\
Seg 21h & Ana\\
Ter 10h & Bia\\
Ter 16h & Caio\\
Qua 9h & Felipe\\
Qua 17h & Caio\\
Qua 19h & Hugo\\
Qui 13h & Gabi\\
Sex 7h & Edu\\
\end{tabular}
\end{center}
% Emacs 24.4.1 (Org mode 8.2.10)
\end{document}
